IdeaRS.OpenModel.Concrete.ColumnData
Column data base

IdeaRS.OpenModel.Concrete.ColumnData.#ctor
Constructor

IdeaRS.OpenModel.Concrete.ColumnData.ImperfectionsInput
Indicates, whether use user values or calculate effect of imperfections.

IdeaRS.OpenModel.Concrete.ColumnData.SecondOrderEffectInput
Indicates, whether use user values or calculate 2'nd order effect.

IdeaRS.OpenModel.Concrete.ColumnData.CalculateY
Gets an indication, whether imperfections and second order have to be performed perpendicular to the y axis.

IdeaRS.OpenModel.Concrete.ColumnData.CalculateZ
Gets an indication, whether imperfections and second order have to be performed perpendicular to the z axis.

IdeaRS.OpenModel.Concrete.ColumnData.L
Gets or sets the system length of column.

IdeaRS.OpenModel.Concrete.ColumnData.EffectiveLength
Gets or sets type of input effective length

IdeaRS.OpenModel.Concrete.ColumnData.L0Y
Gets or sets the user defined effective length of column for Y direction.
If is not defined, the must be valid support data.

IdeaRS.OpenModel.Concrete.ColumnData.L0Z
Gets or sets the user defined effective length of column for Z direction.

IdeaRS.OpenModel.Concrete.ColumnData.FemLenghtFromFlexibleSupport
true if FEM length were calculated from flexible supports

IdeaRS.OpenModel.Concrete.ColumnData.FemL0Y
effective length calculated in FEM for Y direction

IdeaRS.OpenModel.Concrete.ColumnData.FemL0Z
effective length calculated in FEM for Z direction

IdeaRS.OpenModel.Concrete.ColumnData.SupportTopY
Gets or sets the end support. Not necessary if effective lengths are defined.

IdeaRS.OpenModel.Concrete.ColumnData.SupportTopZ
Gets or sets the end support. Not necessary if effective lengths are defined.

IdeaRS.OpenModel.Concrete.ColumnData.SupportBottomY
Gets or sets the end support. Not necessary if effective lengths are defined.

IdeaRS.OpenModel.Concrete.ColumnData.SupportBottomZ
Gets or sets the end support. Not necessary if effective lengths are defined.

IdeaRS.OpenModel.Concrete.ColumnData.ImperfectionDirection
Gets or sets the direction of imperfection.